## data merging

In [4]:
import pandas as pd

data1 = {
    'id':[1,2,3,4,5],
    'name':['Asad','Saad','Fahad','Ali','Hassan'],
    'age':[23,34,23,21,22],
}
df1 = pd.DataFrame(data1)


data2 = {
    'id':[1,2,4,5,6],
    'city':['Karachi','Lahore','Islamabad','Quetta','Peshawar'],
    'occupation':['engineer','doctor','teacher','driver','cook'],
}
df2 = pd.DataFrame(data2)

In [5]:
merged = pd.merge(df1, df2, on='id', how='inner')
merged.head()

   id    name  age       city occupation
0   1    Asad   23    Karachi   engineer
1   2    Saad   34     Lahore     doctor
2   4     Ali   21  Islamabad    teacher
3   5  Hassan   22     Quetta     driver

## Data Concatenation

In [9]:
import pandas as pd
data1 = {
    'Name':['Asad','Saad','Fahad','Ali','Hassan'],
    'age':[23,34,23,21,22]
}
data2 = {
    'Name': ['zain','naveed','irfan','bakir','kashif'],
    'age':[12,34,22,21,26]
}
data3 = {
    'city':['Karachi','Lahore','Islamabad','Quetta','Peshawar'],
    'province':['Sindh','Punjab','Balochistan','KPK','KPK']
 }
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df3 = pd.DataFrame(data3)

concatenated = pd.concat([df1, df2], axis=0)
concatenated.head()


concatenated_col = pd.concat([df1, df3], axis=1)
print(concatenated)
concatenated_col

     Name  age
0    Asad   23
1    Saad   34
2   Fahad   23
3     Ali   21
4  Hassan   22
0    zain   12
1  naveed   34
2   irfan   22
3   bakir   21
4  kashif   26

     Name  age       city     province
0    Asad   23    Karachi        Sindh
1    Saad   34     Lahore       Punjab
2   Fahad   23  Islamabad  Balochistan
3     Ali   21     Quetta          KPK
4  Hassan   22   Peshawar          KPK